package jhkcommon;

/**
 *
 * CifErrorCode
 *
 * @date	H22.8.19	青木・浅見		センター集約対応なし
 * 			H23.12.12	Minori米持		リーディング連携対応(1056追加)
 *
 */




  
public class CifErrorCode {
	
	private static String[][] errorMessage={
			{"0000","test0"},
			{"0001","test1"},
			{"0002","test2"},
			{"0003","test3"},
			{"0004","test4"},
			{"0005","test5"},
			{"0006","エラーが発生しましたがエラーコードが定義されていません。"},
			{"0007","必須項目に入力がありません。"},
			{"0008","数値項目に文字が入力されました。"},
			{"0009","文字項目に数字が入力されました。"},
			{"0010","２バイト項目に１バイト項目が入力されました。"},
			{"1000","入力項目に過ちがあります。"},
			{"1001","該当するデータはありません。"},
			{"1002","利用権限が適正でありません。正しいユーザ名でログインしてください。"},
			{"1003","該当する店舗コードはありません。入力した店舗コードを確認してください。"},
			{"1004","該当する顧客はありません。入力した顧客番号を確認してください。"},
			{"1005","該当する口座はありません。入力した口座番号を確認してください。"},
			{"1006","文字を入力するべき項目に数字が入力されました。"},
			{"1007","数字を入力するべき項目に文字が入力されました。"},
			{"1008","ありえない日付が入力されました。"},
			{"1009","小数点入力不可。"},
			{"1010","登録済。"},
			{"1011","月末分登録済。"},
			{"1012","月末分未登録。"},
			{"1013","現在、混み合っております。しばらく時間をおいてから再度実行してください。"},
			{"1014","再度、メニュー画面から実行してください。"},
			{"1015","検索結果件数が多すぎて帳表出力できません。やりなおす場合は画面表示ボタンを押下してください。"},
			{"1016","移管済です。内容を確認して下さい。"},
			{"1017","実行済です。内容を確認して下さい。"},
			{"1018","未実行です。内容を確認して下さい。"},
			{"1019","実行不可です。内容を確認して下さい。"},
			{"1020","支払期日不一致です。"},
			{"1021","実行金額不一致。"},
			{"1022","ただ今データ登録中です、１０分程度待った後に再度入力してください。"},
			{"1023","処理対象が特定できません。入力条件を見直してください。"},
			{"1024","人格個人の査定損益入力はできません。"},
			{"1025","財務データの登録が無い場合、新規データの入力はできません。"},
			{"1026","前月末時点の顧客番号で入力してください。当月新規顧客の入力はできません。"},
			{"1027","給与所得者の財務データは入力できません。必要があれば人格切替を行ってください。"},
			{"1028","個人と個人事業主の人格変更のみ可能です。"},
			{"1029","人格を変更できる調査カードのデータがありません。"},
			{"1030","法人のみ調査カードの業種変更が可能です。個人の変更はできません。"},
			{"1031","業種を変更できる調査カードのデータがありません。"},
			{"1032","変更前後が同一のデータがあります。"},
			{"1033","変更後を選択してください。"},
			{"1034","生年月日が未来日付です。入力し直して下さい。"},
			{"1035","すでに登録があるので変更できません。"},
			{"1036","時間外のオペレーションはできません。"},
			{"1037","計算結果が一致しません。"},
			{"1038","財務情報の整合性がありません。「データ削除」を利用して現在登録を行おうとしていた決算年月のデータを削除してから、再度データの入力を行ってください。"},
			{"1039","明細設定が未処理のため、印字できる明細がありません。"},
			{"1040","データベースの更新に失敗しました。"},
			{"1041","該当顧客の財務データが存在しません。"},
			{"1042","事務集中部のみ使用可です。"},
			{"1043","所属する店舗コードが違います。店舗コードを確認願います。"},
			{"1044","個人業績評価登録表は登録済みです。新規登録できません。"},
			{"1045","個人業績評価登録表は未登録です。変更できません。"},
			{"1046","担当者別営業実績月報がありません。新規登録できません。"},
			{"1047","営業推進部、ローンセンターのみ使用可です。"},
			{"1048","所定の職位以上の方のみ照会可能です。"},
			{"1049","所属のセンター名が違います。"},
			{"1050","営業店のみ設定可能です。"},
			{"1051","計量中につき、照会はできません。"},
			{"1052","リスク管理部・審査部のみ使用可です。"},
			{"1053","現在、データベース作成中なので照会できません。"},
			{"1054","月初日から「月末データ更新処理終了」まで照会できません。"},
			{"1055","該当の振出人コードで企業情報がありません。<BR>振出人コードを削除し再度「企業情報照会」ボタンを<BR>押下すると手形銘柄で検索します。"},
			{"1056","只今メンテナンス中です。恐れ入りますが、数分後に再度ログインして下さい。"},
			{"1057","財務入力時間外です。財務入力可能時間帯に再度ログインして下さい。"},
			{"1058","notUsed"},
			{"1059","notUsed"},
			{"1060","notUsed"},

			{"9000","システムエラーが発生しました。システム部に連絡してください。"},
			{"9001","ＰＤＦ出力エラー　システム部へ連絡してください。"},
			{"9002","ＨＴＭＬファイルリードエラー　システム部へ連絡してください。"},
			{"9003","Servlet forwardエラー InputDataRemaker.forwardNextHtml"},
			{"9004","サーバがリセットされてしまいました。今行ったオペレーションが完了しているか確認して下さい。"},
			{"9005","notUsed"}
	};
		
//	static String getErrorMessage(String errorCode,HttpServletRequest req, HttpServletResponse res){

	
	public static String getErrorMessage(String errorCode){
		int errorCodeLength=errorCode.length();
		String errorMessageNumber="";
		String errorInputType="";
		String errorOption="";
		String message="";
		
		if(errorCodeLength>=4){
			errorMessageNumber=errorCode.substring(0,4);
			for(int i=0;i<errorMessage.length;i++){
				if(errorMessageNumber.equals(errorMessage[i][0])){
					message=errorMessage[i][1]+"<br>";
					break;
				}
			}
			//NECIKO if(message==""){
			if(message.equals("")){
				message=errorMessage[6][1];
			}
			
			if(errorCodeLength>7){
				errorInputType=errorCode.substring(5,7);
				errorOption=errorCode.substring(7);
				if(errorInputType.equals("01")){
					message+="（入力項目名："+errorOption+"）";
				}else if(errorInputType.equals("02")){
					message+="（入力データ："+errorOption+"）";
				}else if(errorInputType.equals("03")){
					int index=errorOption.indexOf(":");
					message+="（入力項目名："+errorOption.substring(0,index)+"）";
					message+="（入力データ："+errorOption.substring(index+1)+"）";
				}
			}
		}else{
			message=errorMessage[6][1];
		}
		return message;
	}
}
